# <b>Fondamenti di Analisi Dati</b> - a.a. 2019/2020

## 4 <b>Pandas</b>

Pandas è una libreria di alto livello che mette a disposizione diversi strumenti e strutture dati per l'analisi dei dati. In particolare, Pandas è molto utile per manipolare e visualizzare i dati in maniera veloce prima di passare all'analisi vera e propria.<br>
Le due strutture dati principali di Pandas sono le <i>Series</i> e i <i>DataFrame</i>.

### 4.1 Series

Una <b>Series</b> è una struttura monodimensionale (una serie di dati) molto simile a un array di NumPy che consente di indicizzare gli elementi mediante etichette (oltre che con i numeri). I valori contenuti in una serie possono essere di qualsiasi tipo.

In [1]:
import pandas as pd
s1 = pd.Series([7,5,2,8,9,6])
print(s1)

0    7
1    5
2    2
3    8
4    9
5    6
dtype: int64

I numeri visualizzati sulla sinistra rappresentano le etichette dei valori contenute nella serie che di default sono di tipo numerico e
sequenziale. Durante la definizione di una serie è possibile specificare le proprie etichette (una per ogni valore).

In [2]:
valori = [7,5,2,8,9,6]
etichette = ['a','b','c','d','e','f']
s2 = pd.Series(valori, index=etichette)
print(s2)

a    7
b    5
c    2
d    8
e    9
f    6
dtype: int64

Possiamo definire una serie anche mediante un dizionario, specificando contemporaneamente etichette e valori.

In [3]:
s3=pd.Series({'a1':5,'a2':12,'n':94})
print(s3)

a1     5
a2    12
n     94
dtype: int64

È possibile assegnare un nome alla serie.

In [4]:
pd.Series([1,2,3], name='Serie I')

0    1
1    2
2    3
Name: Serie I, dtype: int64

#### 4.1.1 Indicizzazione e slicing

Quando gli indici sono numerici, le serie possono essere indicizzate come gli array di numpy.

In [5]:
print(s1[0],"\n") #indicizzazione
print(s1[0:4:2]) #slicing

7

0    7
2    2
dtype: int64

Quando gli indici sono delle etichette personalizzate l'indicizzazione avviene in maniera simile, ma non è possibile utilizzare lo slicing.

In [6]:
print(s3['a2'])

12

Anche per le serie è possibile modificare i valori tramite indicizzazione.

In [7]:
s3['a2'] = 9
print(s3)

a1     5
a2     9
n     94
dtype: int64

Se l'indice specificato non esiste, verrà creato un elemento nuovo.

In [8]:
s3['b1']=-23
print(s3)

a1     5
a2     9
n     94
b1   -23
dtype: int64

Possiamo specificare più etichette contemporaneamente tramite lista (di etichette).

In [9]:
print(s3[['a1','b1','n']]) #l'argomento passato alla serie è una lista di etichette (con un ordine da noi definito)

a1     5
b1   -23
n     94
dtype: int64

Le serie con etichette alfanumeriche possono essere indicizzate anche seguendo l'ordine in cui i dati sono inseriti nella serie. Per bypassare le etichette e utilizzare l'indice numerico utilizziamo il metodo <b>iloc</b>.

In [10]:
print(s2,'\n')
print("Elemento di indice 'a':",s2['a'])
print("Primo elemento della serie:",s2.iloc[0])

a    7
b    5
c    2
d    8
e    9
f    6
dtype: int64

Elemento di indice 'a': 7
Primo elemento della serie: 7

In certi casi può essere utile ripristinare la numerazione degli indici tramite il metodo <b>reset_index</b>.

In [11]:
print(s3,'\n')
print(s3.reset_index(drop=True)) #drop=True indica di scartare i vecchi indici

a1     5
a2     9
n     94
b1   -23
dtype: int64

0     5
1     9
2    94
3   -23
dtype: int64

Le serie ammettono anche l'indicizzazione logica.

In [12]:
print(s1,'\n') #serie s1
print(s1>2,'\n') #indicizzazione logica per selezionare gli elementi maggiori di 2
print(s1[s1>2],'\n') #applicazione dell'indicizzazione logica

0    7
1    5
2    2
3    8
4    9
5    6
dtype: int64

0     True
1     True
2    False
3     True
4     True
5     True
dtype: bool

0    7
1    5
3    8
4    9
5    6
dtype: int64

Si può specificare la combinazione tra due condizioni tramite gli operatori logici <code>|</code> (or) e <code>&</code> (and), ricordando di racchiudere gli operandi tra parentesi tonde.

In [13]:
print(s1,"\n")
print((s1>2) & (s1<6),"\n")
print(s1[(s1>2) & (s1<6)])

0    7
1    5
2    2
3    8
4    9
5    6
dtype: int64

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

1    5
dtype: int64

In [14]:
print(s1,"\n")
print((s1<2) | (s1>5),"\n")
print(s1[(s1<2) | (s1>5)])

0    7
1    5
2    2
3    8
4    9
5    6
dtype: int64

0     True
1    False
2    False
3     True
4     True
5     True
dtype: bool

0    7
3    8
4    9
5    6
dtype: int64

Come nel caso degli array di NumPy, l'allocazione della memoria è gestita dinamicamente per le Serie. Pertanto, se assegno una serie ad
una nuova variabile e modifico la seconda variabile, verrà modificata anche la prima.

In [15]:
s11=pd.Series([1,2,3])
s12=s11
s12[0]=-1
print(s11)

0   -1
1    2
2    3
dtype: int64

Per ottenere una nuova serie indipendente è necessario usare il metodo <code>copy</code>.

In [16]:
s11=pd.Series([1,2,3])
s12=s11.copy()
s12[0]=-1
print(s11)

0    1
1    2
2    3
dtype: int64

#### 4.1.2 Tipi di dati

Le <i>Series</i> possono contenere diversi tipi di dati.

In [17]:
pd.Series([2.5,3.4,5.2])

0    2.5
1    3.4
2    5.2
dtype: float64

Ad una serie viene associato un unico tipo di dato. Se specifichiamo dati di tipi eterogenei, la serie sarà di tipo <i>object</i>.

In [18]:
s=pd.Series([2.5,'A',5.2])
print(s)

0    2.5
1      A
2    5.2
dtype: object

È possibile cambiare il tipo di dato di una serie al volo con <code>astype</code> in maniera simile a quanto avviene con gli array di NumPy.

In [19]:
s=pd.Series([2,3,8,9,12,45])
print(s,"\n")
print(s.astype(float))

0     2
1     3
2     8
3     9
4    12
5    45
dtype: int64

0     2.0
1     3.0
2     8.0
3     9.0
4    12.0
5    45.0
dtype: float64

In [20]:
s1=pd.Series(['1','2'])
print(s1,"\n")
print(s1.astype(int))

0    1
1    2
dtype: object

0    1
1    2
dtype: int32

In [21]:
s=pd.Series([3.2,'Ciao',7]) #Attenzione: non sempre è possibile cambiare il "tipo"
print(s.astype(int))

ValueError: invalid literal for int() with base 10: 'Ciao'

#### 4.1.3 Operazioni

Sulle serie sono definite le principali operazioni presente per gli array di numpy.

In [22]:
s = pd.Series([2,7,4,8,3,3,2,9,8,5,9])
print("Min:",s.min())
print("Max:",s.max())
print("Mean:",s.mean())

Min: 2
Max: 9
Mean: 5.454545454545454

È possibile ottenere la dimensione di una serie mediante la funzione <code>len</code>.

In [23]:
print(len(s))

11

Per conoscere i valori di una serie esclusi i duplicati utilizziamo il metodo <code>unique</code>.

In [24]:
print("Unique:",s.unique()) #restituisce i valori univoci

Unique: [2 7 4 8 3 9 5]

Per conoscere il numero di valori univoci in una serie, possiamo utilizzare il metodo <code>nunique</code>.

In [25]:
s.nunique()

7

È possibile ottenere i valori univoci di una serie insieme alle frequenze con le quali essi appaiono nella serie mediante il metodo
<code>value_counts</code>.

In [26]:
import numpy as np
np.random.seed(12345)
tmp = pd.Series(np.random.randint(0,10,100))
#print(tmp)
print(tmp.unique()) #valori univoci
tmp.value_counts() #valori univoci con relative frequenze

[2 5 1 4 9 6 7 0 8 3]

5    16
2    15
0    11
9    10
7    10
1    10
8     9
6     9
3     6
4     4
dtype: int64

Il risultato di <code>value_counts</code> è una <code>Series</code> in cui gli indici rappresentano i valori univoci, mentre i valori sono le frequenze con cui essi appaiono nella serie. La serie è ordinata per valori.

Il metodo <code>describe</code> permette di calcolare diverse statistiche dei valori contenuti nella serie.

In [27]:
tmp.describe()

count    100.000000
mean       4.400000
std        2.933609
min        0.000000
25%        2.000000
50%        5.000000
75%        7.000000
max        9.000000
dtype: float64

In [28]:
perc =[.20, .40, .60, .80]
tmp.describe(percentiles=perc)

count    100.000000
mean       4.400000
std        2.933609
min        0.000000
20%        1.000000
40%        3.000000
50%        5.000000
60%        5.000000
80%        7.000000
max        9.000000
dtype: float64

Nelle operazioni tra serie gli elementi vengono associati in base agli indici. Nel caso in cui esiste una perfetta corrispondenza tra gli elementi otteniamo il seguente risultato:

In [29]:
print(pd.Series([1,2,3])+pd.Series([4,4,4]),'\n')
print(pd.Series([1,2,3])*pd.Series([4,4,4]),'\n')

0    5
1    6
2    7
dtype: int64

0     4
1     8
2    12
dtype: int64

Nel caso in cui alcuni indici dovessero essere mancanti, le caselle corrispondenti verranno riempite con <code>NaN</code> (not a number).

In [30]:
s1 = pd.Series([1,4,2], index = [1,2,3])
s2 = pd.Series([4,2,8], index = [0,1,2])
print(s1,'\n')
print(s2,'\n')
print(s1+s2)

1    1
2    4
3    2
dtype: int64

0    4
1    2
2    8
dtype: int64

0     NaN
1     3.0
2    12.0
3     NaN
dtype: float64

In questo caso, l'indice <code>0</code> era presente solo nella seconda serie (<code>s2</code>), mentre l'indice <code>3</code> era presente solo nella prima serie (<code>s1</code>).

Se vogliamo escludere i valori <code>NaN</code> (inclusi i relativi indici) possiamo utilizzare il metodo <code>dropna</code>.

In [31]:
s3=s1+s2
print(s3,"\n")
print(s3.dropna())

0     NaN
1     3.0
2    12.0
3     NaN
dtype: float64

1     3.0
2    12.0
dtype: float64

Possiamo applicare una funzione a tutti gli elementi di una serie mediante il metodo <code>apply</code>. Supponiamo ad esempio di voler
trasformare delle stringhe contenute in una serie in uppercase. Possiamo applicare la funzione <code>str.upper</code> mediante il metodo
<code>apply</code>.

In [32]:
s=pd.Series(['aba','cda','daf','acc'])
s.apply(str.upper)

0    ABA
1    CDA
2    DAF
3    ACC
dtype: object

Tramite apply possiamo applicare funzioni definite dall'utente attraverso le funzioni lambda o mediante la normale sintassi.

In [33]:
def miafun(x):
    y="Stringa: "
    return y+x
s.apply(miafun)

0    Stringa: aba
1    Stringa: cda
2    Stringa: daf
3    Stringa: acc
dtype: object

Possiamo scrivere la stessa funzione, in maniera più compatta, attraverso la funzione lambda.

In [34]:
s.apply(lambda x: "Stringa: "+x)

0    Stringa: aba
1    Stringa: cda
2    Stringa: daf
3    Stringa: acc
dtype: object

È possibile modificare tutte le occorrenze di un dato valore di una serie mediante il metodo <code>replace</code>.

In [35]:
serie = pd.Series([2,5,-4,12,-4,8,-9,0])
print(serie,"\n")
serie=serie.replace({-4:0}) #sostituisci tutti le occorrenze di -4 con 0
print(serie)

0     2
1     5
2    -4
3    12
4    -4
5     8
6    -9
7     0
dtype: int64

0     2
1     5
2     0
3    12
4     0
5     8
6    -9
7     0
dtype: int64

#### 4.1.4 Conversione in array di NumPy

È possibile accedere ai valori della serie in forma di array di numpy tramite la proprietà <code>values</code>

In [36]:
print(s3, "\n")
print(s3.values)

0     NaN
1     3.0
2    12.0
3     NaN
dtype: float64

[nan  3. 12. nan]

<b>N.B.:</b> <code>values</code> non crea una copia indipendente della serie, quindi se modifichiamo l'array di numpy
tramite <code>values</code> modifichiamo anche la serie.

In [37]:
a = s3.values
print(s3,"\n")
a[0]=-1
print(s3)

0     NaN
1     3.0
2    12.0
3     NaN
dtype: float64

0    -1.0
1     3.0
2    12.0
3     NaN
dtype: float64

In [38]:
b = s3.copy().values #in questo modo otteniamo un array di numpy indipendente (tramite copy)
b[1]=-9
print(s3)

0    -1.0
1     3.0
2    12.0
3     NaN
dtype: float64

### 4.2 DataFrame

Un <b>DataFrame</b>, in pratica, è una tabella in cui:
<ul>
    <li>ogni riga rappresenta un'osservazione;
    <li>ogni colonna rappresenta una variabile.
</ul>
Righe e colonne possono essere indentificate da nomi. È molto comune assegnare nomi alle colonne.

#### 4.2.1 Costruzione e visualizzazione di un DataFrame

Un DataFrame può essere costruito da un array bidimensionale (una matrice) di NumPy.

In [41]:
import pandas as pd
import numpy as np
dati = np.random.rand(10,3) #matrice di valori random 10 x 3
#si tratta di una matrice di 10 osservazioni, ognuna caratterizzata da 3 variabili
df = pd.DataFrame(dati,columns=['A','B','C'])
df #in jupyter o in una shell ipython possiamo stampare il dataframe
#semplicemente scrivendo "df". In uno script dovremmo scrivere "print (df)".

          A         B         C
0  0.610945  0.364490  0.156039
1  0.177304  0.867890  0.290095
2  0.585180  0.453995  0.411178
3  0.882634  0.692708  0.279273
4  0.064440  0.198624  0.931683
5  0.854414  0.954735  0.052253
6  0.579472  0.480496  0.021709
7  0.373620  0.414092  0.603907
8  0.671749  0.838866  0.779526
9  0.400701  0.794529  0.893124

Ad ogni riga è stato assegnato in automatico un indice numerico. Se vogliamo possiamo specificare nomi anche per le righe.

In [42]:
np.random.seed(12345) #imposiamo un seed per ripetitibilità
df = pd.DataFrame(np.random.rand(4,3),columns=['A','B','C'],index=['X','Y','Z','W'])
df

          A         B         C
X  0.929616  0.316376  0.183919
Y  0.204560  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

Analogamente a quanto visto nel caso delle serie, è possibile costruire un DataFrame mediante un dizionario che specifica nome e valori
di ogni colonna

In [43]:
pd.DataFrame({'A':np.random.rand(10), 'B':np.random.rand(10), 'C':np.random.rand(10)})

          A         B         C
0  0.008388  0.467599  0.903723
1  0.106444  0.325585  0.024676
2  0.298704  0.439645  0.491747
3  0.656411  0.729689  0.526255
4  0.809813  0.994015  0.596366
5  0.872176  0.676874  0.051958
6  0.964648  0.790823  0.895090
7  0.723685  0.170914  0.728266
8  0.642475  0.026849  0.818350
9  0.717454  0.800370  0.500223

Nel caso di dataset molto grandi, possiamo visualizzare solo le prime righe usando il metodo <b>head</b>.

In [44]:
big_df = pd.DataFrame(np.random.rand(100,3),columns=['A','B','C'])
big_df.head() #mostra di default le prime 5 righe

          A         B         C
0  0.810189  0.095969  0.218950
1  0.258719  0.468106  0.459373
2  0.709510  0.178053  0.531450
3  0.167742  0.768814  0.928171
4  0.609494  0.150183  0.489627

In [45]:
big_df.head(10) #possiamo passare come argomento il numero di righe da visulalizzare

          A         B         C
0  0.810189  0.095969  0.218950
1  0.258719  0.468106  0.459373
2  0.709510  0.178053  0.531450
3  0.167742  0.768814  0.928171
4  0.609494  0.150183  0.489627
5  0.377345  0.848601  0.911097
6  0.383849  0.315496  0.568394
7  0.187818  0.125842  0.687596
8  0.799607  0.573537  0.973230
9  0.634054  0.888422  0.495415

Possiamo invece visualizzare, in maniera analoga, le ultime righe tramite <b>tail</b>.

In [46]:
big_df.tail(10) #se non specifichiamo un numero verranno mostrate, di default, le ultime 5 righe

           A         B         C
90  0.921392  0.144924  0.099874
91  0.411603  0.975125  0.041507
92  0.186914  0.608768  0.087219
93  0.316288  0.610136  0.201195
94  0.691898  0.244627  0.680372
95  0.485938  0.260495  0.282740
96  0.905452  0.275843  0.841148
97  0.196424  0.330583  0.946630
98  0.506072  0.403416  0.027062
99  0.621774  0.347349  0.276799

Possiamo ottenere il numero di righe del DataFrame mediante la funzione <b>len</b>.

In [47]:
print(len(big_df))

100

Per conoscere il numero di righe e colonne di un DataFrame possiamo utilizzare il metodo <b>shape</b>.

In [48]:
print(big_df.shape)

(100, 3)

Analogamente a quanto visto per le Series, possiamo visualizzare un DataFrame come un array di numpy richiamando il metodo <b>values</b>.

In [49]:
print(df,'\n')
print(df.values)

          A         B         C
X  0.929616  0.316376  0.183919
Y  0.204560  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

[[0.92961609 0.31637555 0.18391881]
 [0.20456028 0.56772503 0.5955447 ]
 [0.96451452 0.6531771  0.74890664]
 [0.65356987 0.74771481 0.96130674]]

Anche per i DataFrame valgono le stesse considerazioni sulla memoria fatte per le Series. Per ottenere una copia indipendente di una
DataFrame è possibile utilizzare il metodo <b>copy</b>.

In [50]:
df2=df.copy()

#### 4.2.2 Indicizzazione

Pandas mette a disposizione una serie di strumenti per indicizzare i DataFrame selezionandone righe o colonne. Ad esempio,
possiamo selezionare la colonna B in questo modo:

In [51]:
s=df['B']
print(s,'\n')
print("Tipo di s:",type(s))

X    0.316376
Y    0.567725
Z    0.653177
W    0.747715
Name: B, dtype: float64

Tipo di s: <class 'pandas.core.series.Series'>

Da notare che il risultato di questa operazione è una <code>Series</code> (un <code>DataFrame</code> è in fondo una collezione di <code>Series</code>, ognuna rappresentata da una colonna) che ha come nome il nome della colonna considerata.

In [52]:
dfAC = df[['A','C']]
dfAC #il risultato in questo caso sarà un DataFrame

          A         C
X  0.929616  0.183919
Y  0.204560  0.595545
Z  0.964515  0.748907
W  0.653570  0.961307

Per selezionare invece una riga utilizziamo il metodo <b>loc</b>.

In [53]:
df_rigaX = df.loc['X']
df_rigaX

A    0.929616
B    0.316376
C    0.183919
Name: X, dtype: float64

Possiamo anche selezionare un valore specifico passando a <strong>loc</strong> i nomi di riga e colonna.

In [54]:
df_rigaY_colonnaC = df.loc['Y','C']
df_rigaY_colonnaC

0.5955447029792516

Anche il risultato di questa operazione è una Series, ma in questo caso gli indici rappresentano i nomi delle colonne mentre il nome
della serie corrisponde all'indice della riga selezionata. Come nel caso delle Series, possiamo usare <b>iloc</b> visualizzare le righe in base all'indice numerico.

In [55]:
df.iloc[1] #equivalente a df.loc['Y']

A    0.204560
B    0.567725
C    0.595545
Name: Y, dtype: float64

Anche per <b>iloc</b> è possibile selezionare un valore specifico specificando, questa volta, gli indici di riga e colonna.

In [56]:
df.iloc[1,0]

0.2045602785530397

È anche possibile concatenare le operazioni di indicizzazione per selezionare uno specifico valore.

In [57]:
print(df.iloc[1]['A']) #equivalente a df.iloc[1,0]
print(df['A'].iloc[1])
print(df['A'].loc['Y']) #equivalente a df.loc['Y','A']

0.2045602785530397
0.2045602785530397
0.2045602785530397

Anche in questo caso possiamo utilizzare l'indicizzazione logica in in maniera simile a quanto visto per numpy.

In [58]:
big_df_new=big_df[big_df['B']>0.6]
print(len(big_df), len(big_df_new))
big_df_new.head() #alcuni indici sono mancanti in quanto le righe corrispondenti sono state rimosse

100 41

           A         B         C
3   0.167742  0.768814  0.928171
5   0.377345  0.848601  0.911097
9   0.634054  0.888422  0.495415
10  0.351617  0.714230  0.503929
12  0.495172  0.915094  0.945372

È possibile combinare quanto visto finora per manipolare i dati in maniera semplice e veloce. Supponiamo di voler selezionare le righe
per le quali la somma tra i valori di B e C è maggiore di un certo valore e supponiamo di essere interessati solo ai valori A di tali righe (e non all'intera
riga di valori A,B,C). Il risultato che ci aspettiamo è un array monodimensionale di valori.

In [59]:
print(df,"\n")
res = df[(df['B']+df['C'])>0.7]['A']
print(res, res.shape)

          A         B         C
X  0.929616  0.316376  0.183919
Y  0.204560  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

Y    0.204560
Z    0.964515
W    0.653570
Name: A, dtype: float64 (3,)

Possiamo applicare l'indicizzazione anche a livello dell'intera tabella (oltre che al livello delle singole colonne).

In [60]:
df>0.3

       A     B      C
X   True  True  False
Y  False  True   True
Z   True  True   True
W   True  True   True

Se applichiamo questa indicizzazione al DataFrame otterremo l'apparizione di alcuni <code>NaN</code>, che indicano la presenza degli elementi che
non rispettano la condizione considerata

In [61]:
df[df>0.3]

          A         B         C
X  0.929616  0.316376       NaN
Y       NaN  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

Possiamo rimuovere i valori <code>NaN</code> mediante il metodo <code>dropna</code> come visto nel caso delle Series.<br>
<b>N.B.:</b> verranno rimosse tutte le righe che presentano almeno un NaN.

In [62]:
df[df>0.3].dropna()

          A         B         C
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

Possiamo chiedere a <code>dropna</code> di rimuovere le colonne che presentano almeno un <code>NaN</code> specificando <code>axis=1</code>.

In [63]:
df[df>0.3].dropna(axis=1)

          B
X  0.316376
Y  0.567725
Z  0.653177
W  0.747715

Alternativamente possiamo sostituire i valori <code>NaN</code> al volo mediante la funzione <code>fillna</code>.

In [64]:
df[df>0.3].fillna('VAL') #sostiuisce i NaN con 'VAL'

          A         B         C
X  0.929616  0.316376       VAL
Y       VAL  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W   0.65357  0.747715  0.961307

Anche in questo caso, come visto nel caso delle Series possiamo ripristinare l'ordine degli indici mediante il metodo <code>reset_index</code>.

In [65]:
print(df)
print(df.reset_index(drop=True))

          A         B         C
X  0.929616  0.316376  0.183919
Y  0.204560  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307
          A         B         C
0  0.929616  0.316376  0.183919
1  0.204560  0.567725  0.595545
2  0.964515  0.653177  0.748907
3  0.653570  0.747715  0.961307

Se non specifichiamo <code>drop=True</code>, i vecchi indici verranno mantenuti in una nuova colonna.

In [66]:
print(df.reset_index())

  index         A         B         C
0     X  0.929616  0.316376  0.183919
1     Y  0.204560  0.567725  0.595545
2     Z  0.964515  0.653177  0.748907
3     W  0.653570  0.747715  0.961307

Possiamo impostare qualsiasi colonna come nuovo indice.

In [67]:
df.set_index('A')

                 B         C
A
0.929616  0.316376  0.183919
0.204560  0.567725  0.595545
0.964515  0.653177  0.748907
0.653570  0.747715  0.961307

Va notato che questa operazione non modifica di fatto il DataFrame, ma crea una nuova "vista" dei dati con la modifica richiesta.

In [68]:
df

          A         B         C
X  0.929616  0.316376  0.183919
Y  0.204560  0.567725  0.595545
Z  0.964515  0.653177  0.748907
W  0.653570  0.747715  0.961307

Possiamo salvare questa versione modificata del dataframe in uno nuovo.

In [69]:
df2=df.set_index('A')
df2

                 B         C
A
0.929616  0.316376  0.183919
0.204560  0.567725  0.595545
0.964515  0.653177  0.748907
0.653570  0.747715  0.961307

#### 4.2.3 Manipolazione di DataFrame

È possibile modificare i valori contenuti nelle righe e nelle colone di un DataFrame.

In [70]:
df['B']*=2 #moltiplica tutti i valori della colonna B per 2
df.head()

          A         B         C
X  0.929616  0.632751  0.183919
Y  0.204560  1.135450  0.595545
Z  0.964515  1.306354  0.748907
W  0.653570  1.495430  0.961307

In [71]:
df.iloc[2]=df.iloc[2]/3 #divide per 3 tutti i valori della riga di indice 2 
df.head()

          A         B         C
X  0.929616  0.632751  0.183919
Y  0.204560  1.135450  0.595545
Z  0.321505  0.435451  0.249636
W  0.653570  1.495430  0.961307

Possiamo definire una nuova colonna con una semplice operazione di assegnamento.

In [72]:
df['D'] = df['A'] + df['C']
df['E'] = np.ones(len(df))*3
df.head()

          A         B         C         D    E
X  0.929616  0.632751  0.183919  1.113535  3.0
Y  0.204560  1.135450  0.595545  0.800105  3.0
Z  0.321505  0.435451  0.249636  0.571140  3.0
W  0.653570  1.495430  0.961307  1.614877  3.0

Possiamo rimuovere una colonna mediante il metodo <code>drop</code> e specificando <code>axis=1</code> per indicare che vogliamo rimuovere una colonna.

In [73]:
df.drop('E',axis=1).head()

          A         B         C         D
X  0.929616  0.632751  0.183919  1.113535
Y  0.204560  1.135450  0.595545  0.800105
Z  0.321505  0.435451  0.249636  0.571140
W  0.653570  1.495430  0.961307  1.614877

Il metodo <code>drop</code> non modifica il DataFrame ma genera solo una nuova "vista".

In [74]:
df.head()

          A         B         C         D    E
X  0.929616  0.632751  0.183919  1.113535  3.0
Y  0.204560  1.135450  0.595545  0.800105  3.0
Z  0.321505  0.435451  0.249636  0.571140  3.0
W  0.653570  1.495430  0.961307  1.614877  3.0

Possiamo rimuovere la colonna effettivamente mediante un assegnamento.

In [75]:
df=df.drop('E',axis=1) #equivalente a df.drop('E',axis=1, inplace=True)
df.head()

          A         B         C         D
X  0.929616  0.632751  0.183919  1.113535
Y  0.204560  1.135450  0.595545  0.800105
Z  0.321505  0.435451  0.249636  0.571140
W  0.653570  1.495430  0.961307  1.614877

La rimozione delle righe avviene allo stesso modo, ma bisogna specificare <code>axis = 0</code>.

In [76]:
df.drop('X', axis=0)

          A         B         C         D
Y  0.204560  1.135450  0.595545  0.800105
Z  0.321505  0.435451  0.249636  0.571140
W  0.653570  1.495430  0.961307  1.614877

È possibile aggiungere una nuova riga in coda al DataFrame mediante il metodo <b>append</b>. Dato che le righe di un DataFrame
sono delle Series, dovremo costruire una serie con i giusti indici (corrispondenti alle colonne del DataFrame) e il giusto nome
(corrispondente al nuovo indice)

In [77]:
new_row=pd.Series([1,2,3,4], index=['A','B','C','D'], name='H')
print(new_row)
df.append(new_row)

A    1
B    2
C    3
D    4
Name: H, dtype: int64

          A         B         C         D
X  0.929616  0.632751  0.183919  1.113535
Y  0.204560  1.135450  0.595545  0.800105
Z  0.321505  0.435451  0.249636  0.571140
W  0.653570  1.495430  0.961307  1.614877
H  1.000000  2.000000  3.000000  4.000000

Possiamo aggiungere più di una riga alla volta specificando un DataFrame.

In [78]:
new_rows = pd.DataFrame({'A':[0,1],'B':[2,3],'C':[4,5],'D':[6,7]}, index=['H','K'])
new_rows

   A  B  C  D
H  0  2  4  6
K  1  3  5  7

In [79]:
df.append(new_rows)

          A         B         C         D
X  0.929616  0.632751  0.183919  1.113535
Y  0.204560  1.135450  0.595545  0.800105
Z  0.321505  0.435451  0.249636  0.571140
W  0.653570  1.495430  0.961307  1.614877
H  0.000000  2.000000  4.000000  6.000000
K  1.000000  3.000000  5.000000  7.000000

#### 4.2.4 Operazioni

Restano definite sui DataFrame, con le opportune differenze, le operazioni viste nel caso delle serie. In genere, queste vengono applicate
a tutte le colonne del DataFrame in maniera indipendente.

In [80]:
df.mean() #media di ogni colonna

A    0.527313
B    0.924771
C    0.497601
D    1.024914
dtype: float64

In [81]:
df.max() #massimo di ogni colonna

A    0.929616
B    1.495430
C    0.961307
D    1.614877
dtype: float64

In [82]:
df.max() #massimo di ogni colonna

A    0.929616
B    1.495430
C    0.961307
D    1.614877
dtype: float64

Dato che le colonne di un DataFrame sono delle serie, ad esse può essere applicato il metodo <b>apply</b>.

In [83]:
df['A']=df['A'].apply(lambda x: "Numero: "+str(x))
df

                            A         B         C         D
X  Numero: 0.9296160928171479  0.632751  0.183919  1.113535
Y  Numero: 0.2045602785530397  1.135450  0.595545  0.800105
Z  Numero: 0.3215048399118739  0.435451  0.249636  0.571140
W  Numero: 0.6535698708517353  1.495430  0.961307  1.614877

Possiamo ordinare le righe di un DataFrame rispetto ai valori di una delle colonne mediante il metodo <b>sort_values</b>.

In [84]:
df.sort_values(by='D')

                            A         B         C         D
Z  Numero: 0.3215048399118739  0.435451  0.249636  0.571140
Y  Numero: 0.2045602785530397  1.135450  0.595545  0.800105
X  Numero: 0.9296160928171479  0.632751  0.183919  1.113535
W  Numero: 0.6535698708517353  1.495430  0.961307  1.614877

Per rendere l'ordinamento permanente, dobbiamo effettuare un assegnamento.

In [85]:
df=df.sort_values(by='D') #equivalente a df.sort_values(by='D', inplace=True)
df

                            A         B         C         D
Z  Numero: 0.3215048399118739  0.435451  0.249636  0.571140
Y  Numero: 0.2045602785530397  1.135450  0.595545  0.800105
X  Numero: 0.9296160928171479  0.632751  0.183919  1.113535
W  Numero: 0.6535698708517353  1.495430  0.961307  1.614877

#### 4.2.5 Groupby

Il metodo <b>groupby</b> permette di raggruppare le righe di un DataFrame e richiamare delle funzioni aggreggate su di esse.
Consideriamo un DataFrame un po' più rappresentativo.

In [86]:
df=pd.DataFrame({'income':[10000,11000,9000,3000,1000,5000,7000,2000,7000,12000,8000],\
'age':[32,32,45,35,28,18,27,45,39,33,32],\
'sex':['M','F','M','M','M','F','F','M','M','F','F'],\
'company':['CDX','FLZ','PTX','CDX','PTX','CDX','FLZ','CDX','FLZ','PTX','FLZ']})
df

    income  age sex company
0    10000   32   M     CDX
1    11000   32   F     FLZ
2     9000   45   M     PTX
3     3000   35   M     CDX
4     1000   28   M     PTX
5     5000   18   F     CDX
6     7000   27   F     FLZ
7     2000   45   M     CDX
8     7000   39   M     FLZ
9    12000   33   F     PTX
10    8000   32   F     FLZ

Il metodo <code>groupby</code> ci permette di raggruppare le righe del DataFrame per valore, rispetto a una colonna specificata. Supponiamo di voler raggruppare tutte le righe che hanno lo stesso valore di <i>sex</i>.

In [87]:
df.groupby('sex')

Questa operazione restituisce un oggetto di tipo <i>DataFrameGroupby</i> sul quale sarà possibile effettuare delle operazioni aggregate (ad
esempio, somme e medie). Supponiamo adesso di voler calcolare la media di tutti i valori che ricadono nello stesso gruppo (ovvero
calcoliamo la media delle righe che hanno lo stesso valore di sex).

In [88]:
df.groupby('sex').mean()

          income        age
sex
F    8600.000000  28.400000
M    5333.333333  37.333333

Se siamo interessati a una sola delle variabili possiamo selezionarla prima o dopo l'operazione sui dati aggregati.

In [89]:
df.groupby('sex')['age'].mean() #equivalentemente: df.groupby('sex').mean()['age']

sex
F    28.400000
M    37.333333
Name: age, dtype: float64

La tabella mostra il reddito medio e l'età media dei soggetti di sesso maschile e femminile. Dato che l'operazione di media si può applicare solo a valori numerici, la colonna Company è stata esclusa. Possiamo ottenere una tabella simile in cui mostriamo la somma dei redditi e la somma delle età cambiando <code>mean</code> in <code>sum</code>.

In [90]:
df.groupby('sex').sum()

     income  age
sex
F     43000  142
M     32000  224

In generale, è possibile utilizzare diverse funzioni aggregate oltre a <code>mean</code> e <code>sum</code> (ad es. <code>min</code>, <code>max</code>, <code>std</code>). Due funzioni particolarmente interessanti da usare in questo contesto sono <code>count</code> e <code>describe</code>. In particolare, <code>count</code> conta il numero di elementi interessati, mentre <code>describe</code> calcola diverse statistiche dei valori interessati.

In [91]:
df.groupby('sex').count()

     income  age  company
sex
F         5    5        5
M         6    6        6

Il numero di elementi è uguale per le varie colonne in quanto non ci sono valori NaN nel DataFrame.

In [92]:
df.groupby('sex').describe()

    income                                                             \
     count         mean          std     min     25%     50%      75%
sex
F      5.0  8600.000000  2880.972058  5000.0  7000.0  8000.0  11000.0
M      6.0  5333.333333  3829.708431  1000.0  2250.0  5000.0   8500.0

               age
         max count       mean       std   min    25%   50%   75%   max
sex
F    12000.0   5.0  28.400000  6.268971  18.0  27.00  32.0  32.0  33.0
M    10000.0   6.0  37.333333  6.947422  28.0  32.75  37.0  43.5  45.0

Per ogni variabile numerica (age e income) sono state calcolate diverse statistiche. A volte può essere più chiaro visualizzare il dataframe trasposto.

In [93]:
df.groupby('sex').describe().transpose() #equivalente a df.groupby('sex').describe().T

sex                      F             M
income count      5.000000      6.000000
       mean    8600.000000   5333.333333
       std     2880.972058   3829.708431
       min     5000.000000   1000.000000
       25%     7000.000000   2250.000000
       50%     8000.000000   5000.000000
       75%    11000.000000   8500.000000
       max    12000.000000  10000.000000
age    count      5.000000      6.000000
       mean      28.400000     37.333333
       std        6.268971      6.947422
       min       18.000000     28.000000
       25%       27.000000     32.750000
       50%       32.000000     37.000000
       75%       32.000000     43.500000
       max       33.000000     45.000000

Questa vista ci permette di comparare diverse statistiche delle due variabili <i>age</i> e <i>income</i> per <i>M</i> e <i>F</i> .

#### 4.2.6 Crosstab

Le <b>Crosstab</b> permettono di descrivere le relazioni tra due o più variabili <i>categoriche</i>. Una volta specificata una coppia di variabili categoriche, le righe e colonne della crosstab (nota anche come "tabella di contingenza") enumerano indipendentemente tutti i valori univoci delle due variabili categoriche, così che ogni cella della crosstab identifica una determinata coppia di volari. All'interno delle celle vengono dunque riportati i numeri di elementi per i quali le due variabili categoriche assumono una determinata coppia di valori.

Supponiamo di voler studiare le relazioni tra <i>company</i> e <i>sex</i>.

In [94]:
pd.crosstab(df['sex'],df['company'])

company  CDX  FLZ  PTX
sex
F          1    3    1
M          3    1    2

La tabella sopra ci dice che nella compagnia CDX, un soggetto è di sesso femminile, mentre tre soggetti sono di sesso maschile. Allo stesso modo, un soggetto della compagnia FLZ è di sesso maschile, mentre tre soggetti sono di sesso femminile. È possibile ottenere delle frequenze invece che dei conteggi mediante <code>normalize=True</code>

In [95]:
pd.crosstab(df['sex'],df['company'], normalize=True)

company       CDX       FLZ       PTX
sex
F        0.090909  0.272727  0.090909
M        0.272727  0.090909  0.181818

Alternativamente, possiamo normalizzare la tabella solo per righe o solo per colonne specificando <code>normalize='index'</code> o
<code>normalize='columns'</code>.

In [96]:
pd.crosstab(df['sex'],df['company'], normalize='index')

company  CDX       FLZ       PTX
sex
F        0.2  0.600000  0.200000
M        0.5  0.166667  0.333333

Questa tabella riporta le percentuali di persone, suddivise per sesso, che lavorano nelle tre diverse compagnie per ciascun sesso (ad es. il 20% delle donne lavora presso CDX). Analogamente possiamo normalizzare per colonne.

In [97]:
pd.crosstab(df['sex'],df['company'], normalize='columns')

company   CDX   FLZ       PTX
sex
F        0.25  0.75  0.333333
M        0.75  0.25  0.666667

Questa tabella riporta le percentuali di uomini e donne che lavorano in ciascuna compagnia (per es. il 25% dei lavoratori di CDX è donna).

Se vogliamo studiare le relazioni tra più di due variabili categoriche possiamo specificare una lista di colonne quando costruiamo la
crosstab.

In [98]:
pd.crosstab(df['sex'],[df['age'],df['company']])

age      18  27  28  32      33  35  39  45
company CDX FLZ PTX CDX FLZ PTX CDX FLZ CDX PTX
sex
F         1   1   0   0   2   1   0   0   0   0
M         0   0   1   1   0   0   1   1   1   1

Ogni cella di questa crosstab conta il numero di osservazioni che riportano una determinata terna di valori (ad es. un soggetto è di sesso maschile, lavora per PTX e 28 ha anni, mentre due soggetti sono di sesso femminile, lavorano per FLZ e hanno 32 anni).
Oltre a riportare conteggi e frequenze una crosstab permette di calcolare statistiche di terze variabili considerate non categoriche.
Supponiamo di voler conoscere l'età media delle persone di un dato sesso in una data azienda. Possiamo costruire una
crosstab specificando una nuova variabile (age) per <code>values</code>. Dato che di questa variabile bisognerà calcolare un qualche valore
aggregato, dobbiamo anche specificare <code>aggfunc</code> per esempio pari a <code>mean</code>.

In [99]:
pd.crosstab(df['sex'],df['company'], values=df['age'], aggfunc='mean')

company        CDX        FLZ   PTX
sex
F        18.000000  30.333333  33.0
M        37.333333  39.000000  36.5

La crosstab indica che l'età media delle persone di sesso maschile che lavorano per CDX è di 37,33 anni.

#### 4.2.7 Manipolazione "esplicita" di DataFrame

In alcuni casi può essere utile trattare i DataFrame "esplicitamente" come matrici di valori. Consideriamo ad esempio il seguente
DataFrame:

In [100]:
df123 = pd.DataFrame({'Category':[1,2,3], 'NumberOfElements':[3,1,2]})
df123

   Category  NumberOfElements
0         1                 3
1         2                 1
2         3                 2

Supponiamo di voler costruire un nuovo DataFrame che, per ogni riga del dataframe df123, contenga esattamente "NumberOfElements"
righe con valore di "NumberOfElements" pari a uno. Vogliamo in pratica "espandere" il DataFrame in questo modo:

In [101]:
new_df123 = pd.DataFrame({'Category':[1,1,1,2,3,3], 'NumberOfElements':[1,1,1,1,1,1]})
new_df123

   Category  NumberOfElements
0         1                 1
1         1                 1
2         1                 1
3         2                 1
4         3                 1
5         3                 1

Per farlo in maniera automatica, possiamo trattare il DataFrame più "esplicitamente" come una matrice di valori iterandone le righe. Il
nuovo DataFrame sarà dapprima costruito come una lista di Series (le righe del DataFrame) e poi trasformato in un DataFrame.

In [105]:
print(df123,"\n")
newdat = []
for index, row in df123.iterrows(): #iterrows permette di iterare le righe di un DataFrame
    for j in range(row['NumberOfElements']):
        #print(j)
        newrow = row.copy()
        newrow['NumberOfElements']=1
        newdat.append(newrow)
print(newdat)
print(pd.DataFrame(newdat))

   Category  NumberOfElements
0         1                 3
1         2                 1
2         3                 2

[Category            1
NumberOfElements    1
Name: 0, dtype: int64, Category            1
NumberOfElements    1
Name: 0, dtype: int64, Category            1
NumberOfElements    1
Name: 0, dtype: int64, Category            2
NumberOfElements    1
Name: 1, dtype: int64, Category            3
NumberOfElements    1
Name: 2, dtype: int64, Category            3
NumberOfElements    1
Name: 2, dtype: int64]
   Category  NumberOfElements
0         1                 1
0         1                 1
0         1                 1
1         2                 1
2         3                 1
2         3                 1

In [104]:
newdat = pd.DataFrame(newdat).reset_index(drop=True)
newdat

   Category  NumberOfElements
0         1                 1
1         1                 1
2         1                 1
3         2                 1
4         3                 1
5         3                 1

#### 4.2.8 Input/Output

Pandas mette a disposizione diverse funzioni per leggere e scrivere dati. Vedremo in particolare le funzioni per leggere e scrivere file <i>csv</i>. I file csv possono essere letti, sia in locale che in remoto, tramite il metodo <code>pd.read_csv</code>.

In [106]:
#https://archive.ics.uci.edu/ml/datasets/iris
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')
data.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

Se non indichiamo alcun parametro, <code>read_csv</code> considererà la prima riga del csv come header.
Se il nostro file csv non contiene un header possiamo utilizzare il parametro <code>header=None</code> per ignorare la prima riga o fornire l'intestazione tramite parametro <code>names=[]</code>.

In [107]:
#hedaer=None: non consideriamo la prima riga come header
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header=None)
data.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [108]:
#names=[lista nomi colonne]: forniamo i nomi delle colonne
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',  names=['A','B','C','D','E'])
data.head()

     A    B    C    D            E
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [109]:
#N.B.: se il numero di colonne indicate non corrisponde al numero di colonne del dataset
#alcune colonne verranno convertite in indici (nel caso in cui la lista di nomi sia inferiore al numero di colonne del dataset)
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',  names=['A','B','C'])
data.head()

           A    B            C
5.1 3.5  1.4  0.2  Iris-setosa
4.9 3.0  1.4  0.2  Iris-setosa
4.7 3.2  1.3  0.2  Iris-setosa
4.6 3.1  1.5  0.2  Iris-setosa
5.0 3.6  1.4  0.2  Iris-setosa

In [110]:
data.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 150 entries, (5.1, 3.5) to (5.9, 3.0)
Data columns (total 3 columns):
A    150 non-null float64
B    150 non-null float64
C    150 non-null object
dtypes: float64(2), object(1)
memory usage: 4.3+ KB

In [111]:
#o aggiunte con valore NaN per ogni riga (nel caso in cui la lista passata a "names" contenga un numero di colonne maggiore)
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',  names=['A','B','C','D','E','F'])
data.head()

     A    B    C    D            E   F
0  5.1  3.5  1.4  0.2  Iris-setosa NaN
1  4.9  3.0  1.4  0.2  Iris-setosa NaN
2  4.7  3.2  1.3  0.2  Iris-setosa NaN
3  4.6  3.1  1.5  0.2  Iris-setosa NaN
4  5.0  3.6  1.4  0.2  Iris-setosa NaN

In [ ]:
#In alternativa possiamo usare il metodo "coloums" del dataset appena creato
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')
data.columns = ['A','B','C','D','E']
data.head()

In [ ]:
data=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',\
                 names=['sepal length in cm', 'sepal width in cm', 'petal length in cm', 'petal width in cm', 'class'])
data.head()

Possiamo, invece, scrivere un file csv su disco tramite il metodo <code>to_csv</code>.

In [ ]:
data.to_csv('file.csv')

Leggiamo il file appena scritto.

In [ ]:
data=pd.read_csv('file.csv')
data.head()

Come possiamo notare, la prima colonna contiene i valori degli indici, ma non ha nome poiché viene considerata una colonna a tutti gli effetti quando esportiamo il DataFrame su un file csv.

Possiamo risolvere il problema in diversi modi:
<ul>
    <li>Eliminare la colonna "Unnamed: 0" dal DataFrame appena caricato (solo se gli indici sono sequenziali)
    <li>Specificare di usare la colonna "Unnamed: 0" come colonna degli indici durante il caricamento
    <li>Salvare il DataFrame senza indici (solo se gli indici sono sequenziali)
</ul>

In [ ]:
data=pd.read_csv('file.csv')
data.drop('Unnamed: 0', axis=1).head() #eliminiamo la colonna

In [ ]:
#specifichiamo, durante il caricamento, che la colonna "Unnamed: 0" contiene gli indidici
data=pd.read_csv('file.csv', index_col='Unnamed: 0')
data.head()

In [ ]:
data.to_csv('file.csv', index=False) #salviamo il file senza indici
pd.read_csv('file.csv').head()

## 5 <b>Esempio di manipolazione di dati</b>

Spesso un dataset dev'essere opportunamente trattato prima dell'analisi. Vediamo un esempio di come combinare gli strumenti discussi
finora per manipolare un dataset reale.<br>
Consideriamo il dataset presente su <a href="https://www.kaggle.com/lava18/google-play-store-apps" target="_blank">https://www.kaggle.com/lava18/google-play-store-apps</a> (disponibile per il download)

In [ ]:
data = pd.read_csv('googleplaystore.csv')
data.head()

Visualizziamo le proprietà del dataset.

In [ ]:
data.info()

Il dataset contiene osservazioni e variabili. Osserviamo che molte delle variabili (tranne "Rating") sono di tipo "object", anche se
rappresentano dei valori numerici (es., Reviews, Size, Installs e Price). Osservando le prime righe del DataFrame visualizzate sopra
possiamo dedurre che:
<ul>
    <li>Size non è rappresentato come valore numerico in quanto contiene l'unità di misura "M";
    <li>Installs è in realtà una variabile categorica (riporta un "+" alla fine, quindi indica la classe "più di n installazioni");
</ul>
Non ci sono motivazioni apparenti per cui Reviews e Rating non siano stati interpretati come numeri. Costruiamo una funzione filtro che
identifichi se un valore è convertibile in un dato tipo o meno.

In [ ]:
def cannot_convert(x, t=float):
    try:
        t(x)
        return False
    except:
        return True
print(cannot_convert('12'))
print(cannot_convert('12f'))

Applichiamo il filtro alla colonna Review per visualizzare i valori che non possono essere convertiti.

In [ ]:
list(filter(cannot_convert,data['Reviews']))

Sostituiamo il valore trovato con una versione numerica tramite il metodo <code>replace</code>.

In [ ]:
data['Reviews']=data['Reviews'].replace({'3.0M':3000000})

A questo punto possiamo convertire i valori della colonna in interi.

In [ ]:
data['Reviews']=data['Reviews'].astype(int)

Visualizziamo nuovamente le informazioni del DataFrame.

In [ ]:
data.info()

Reviews è adesso un intero. Eseguiamo un lavoro simile sulla variabile Price.

In [ ]:
list(filter(cannot_convert, data['Price']))[:10] #visualizziamo solo i primi 10 elementi

Possiamo convertire le stringhe in float eliminando il dollaro iniziale mediante <code>apply</code>.

In [ ]:
def strip_dollar(x):
    if x[0]=='$':
        return x[1:]
    else:
        return x
data['Price']=data['Price'].apply(strip_dollar)

Vediamo se ci sono ancora valori che non possono essere convertiti.

In [ ]:
list(filter(cannot_convert, data['Price']))

Dato che non sappiamo come interpretare il valore "Everyone", lo sostituiremo con un NaN.

In [ ]:
data['Price']=data['Price'].replace({'Everyone':np.nan})

Adesso possiamo procedere alla conversione in float.

In [ ]:
data['Price']=data['Price'].astype(float)
data.info()

Modifichiamo anche "Size" eliminando la "M" finale.

In [ ]:
data['Size']=data['Size'].apply(lambda x : x[:-1])

Verifichiamo l'esistenza di valori non convertibili.

In [ ]:
list(filter(cannot_convert,data['Size']))[:10]

Sostituiamo questi valori con NaN.

In [ ]:
data['Size']=data['Size'].replace({'Varies with devic':np.nan})

Verifichiamo nuovamente la presenza di valori che non possono essere convertiti.

In [ ]:
list(filter(cannot_convert,data['Size']))

Possiamo rimuovere la virgola usata per indicare le migliaia e convertire in float.

In [ ]:
data['Size']=data['Size'].apply(lambda x: float(str(x).replace(',','')))

In [ ]:
data.info()

Valutiamo se è il caso di trasformare anche "Installs" in un valore numerico. Vediamo quanti valori univoci di "Installs" ci sono nel dataset.

In [ ]:
data['Installs'].nunique()

Abbiamo solo 22 valori, che paragonati alle 10841 osservazioni ci suggeriscono di considerare "Installs" come variabile categorica e non come valore numerico.<br>
Il DataFrame contiene dei NaN che possiamo tenere o scartare. In questo caso, che i dati sono molti, possiamo rimuoverli
tramite <code>dropna</code>.

In [ ]:
data=data.dropna()

Adesso possiamo iniziare a esplorare i dati con gli strumenti visti finora.

Visualizziamo ad esempio i valori medi delle variabili numeriche per <i>categoria (Category)</i>.

In [ ]:
data.groupby('Category').mean()

O per esempio il numero medio di review per tipo (variabile Type):

In [ ]:
data.groupby('Type').mean()['Reviews']

## - Pandas - FINE